[
  "In JavaScript, arrays are objects — typeof [] === 'object'.",
  "CSS Grid and Flexbox solve different layout problems — Grid for 2D, Flexbox for 1D.",
  "The 'this' keyword in JavaScript refers to the object that is executing the current function.",
  "React's virtual DOM makes updates efficient by only re-rendering what changed.",
  "Python uses indentation to define code blocks instead of curly braces.",
  "Git branches let you work on features without affecting the main codebase.",
  "SQL JOIN combines rows from two or more tables based on a related column.",
  "RESTful APIs use HTTP methods: GET (read), POST (create), PUT (update), DELETE (remove).",
  "A closure in JavaScript is a function that remembers its outer variables.",
  "TypeScript adds static typing to JavaScript, catching errors before runtime.",
  "The box model in CSS includes: content, padding, border, and margin.",
  "async/await is syntactic sugar for Promises, making async code look synchronous.",
  "npm (Node Package Manager) is the default package manager for Node.js.",
  "CSS specificity determines which styles are applied: inline > ID > class > element.",
  "The spread operator (...) in JavaScript expands iterables into individual elements.",
  "LocalStorage in the browser persists data even after closing the tab or browser.",
  "The DOM is a tree structure where every HTML element is a node.",
  "HTTP is stateless, meaning each request is independent with no memory of previous interactions.",
  "CORS controls which external domains are allowed to access your backend API.",
  "The event loop in JavaScript manages the execution of synchronous and asynchronous code.",
  "The shadow DOM allows Web Components to have encapsulated styles and markup.",
  "In CSS, rem units are relative to the root font size, not the parent element.",
  "A Promise in JavaScript can be in one of three states: pending, fulfilled, or rejected.",
  "JWTs (JSON Web Tokens) are commonly used for stateless authentication.",
  "MongoDB stores data in BSON — a binary form of JSON.",
  "Docker containers package code, dependencies, and environment into a portable unit.",
  "CDNs deliver static files from servers closer to the user to improve load times.",
  "In SQL, a primary key uniquely identifies each row in a table.",
  "GraphQL lets clients request exactly the data they need — no more, no less.",
  "CSS transitions animate changes between property values over time.",
  "WebSockets provide full-duplex communication between client and server.",
  "The CSS cascade defines how conflicting styles are resolved based on origin, specificity, and order.",
  "Node.js is single-threaded but uses libuv to handle asynchronous operations.",
  "In React, keys help identify elements during reconciliation for efficient rendering.",
  "PostgreSQL supports advanced data types like JSONB, arrays, and geometric types.",
  "A CPU core can run one thread at a time; more cores means more parallelism.",
  "In Git, merging preserves history while rebasing rewrites it.",
  "REST APIs rely on resource URLs, while RPC-style APIs focus on actions/functions.",
  "CSS variables (custom properties) are dynamically changeable at runtime.",
  "Hashing is one-way; encryption is reversible with a key.",
  "React's useEffect runs after the component renders, not during the rendering phase.",
  "In HTTP/2, multiple requests can be sent in parallel over a single TCP connection.",
  "A semaphore controls access to shared resources in concurrent programming.",
  "Minification removes whitespace and shortens variable names to reduce file size.",
  "A CDN cache hit means the file comes from the CDN server, not your origin server.",
  "SQL indexes speed up read queries but slow down write operations.",
  "The backend typically handles authentication, database access, and business logic.",
  "Hoisting in JavaScript moves variable and function declarations to the top of their scope.",
  "HTTPS encrypts data using TLS to protect information in transit.",
  "A reverse proxy forwards client requests to backend servers and can handle load balancing.",
  "JSON.parse converts a JSON string into a JavaScript object.",
  "React components must be pure functions — given the same input, they return the same output.",
  "Incremental builds compile only changed files, speeding up development.",
  "CSS clamp() sets a value within a min, preferred, and max range.",
  "Redis stores data in-memory, making it extremely fast for caching.",
  "Middleware in Express.js runs between the request and response cycle.",
  "The paint and layout stages of a browser render tree determine how elements appear visually.",
  "In SQL, WHERE filters rows before grouping, HAVING filters groups after grouping.",
  "A 200 OK status means the request succeeded; 404 means the resource was not found.",
  "The public folder in many frontend frameworks serves static files directly.",
  "Tailwind CSS is a utility-first framework that allows rapid UI styling.",
  "A monolith architecture contains all functionality in one codebase.",
  "Microservices break an application into smaller, independently deployable services.",
  "CSR (Client-Side Rendering) loads JavaScript first; SSR (Server-Side Rendering) serves HTML first.",
  "In React, lifting state up refers to moving shared state to the nearest common ancestor.",
  "SQL foreign keys maintain referential integrity between tables.",
  "Tree-shaking removes unused code from JavaScript bundles.",
  "The viewport meta tag controls how websites render on mobile devices.",
  "Web workers allow JavaScript to run background threads without blocking the main thread.",
  "API rate limiting prevents abuse by tracking how many requests a user makes.",
  "Event bubbling means events propagate from a child element up to its parents.",
  "bcrypt adds a salt and multiple hashing rounds for secure password storage.",
  "CSS absolute positioning removes an element from the normal document flow.",
  "The heap is used for dynamic memory allocation; the stack is for static memory allocation.",
  "The fetch API returns a Promise that resolves to a Response object.",
  "Content Delivery Networks reduce latency by caching files geographically.",
  "Big O notation describes how algorithms scale with input size.",
  "The main difference between PUT and PATCH is that PUT replaces a resource, while PATCH updates parts of it.",
  "SQL transactions ensure multiple operations succeed or fail as a unit.",
  "SASS extends CSS with variables, nesting, and mixins.",
  "A virtual machine emulates hardware; containers share the host OS kernel.",
  "In JavaScript, == performs type coercion while === checks both type and value.",
  "The browser’s repaint step updates element visibility without recalculating layout.",
  "LocalHosting images avoids third-party dependency issues and improves speed.",
  "HTTP status 500 indicates a server error — something went wrong on the backend.",
  "Rate limiting protects APIs from spam, abuse, and accidental overload.",
  "The CSS z-index determines element stacking order only for positioned elements.",
  "Indexes in MongoDB use B-tree data structures for fast querying.",
  "A webhook is a user-defined HTTP callback triggered by an event.",
  "The Node.js event loop executes callbacks from the message queue.",
  "Graph databases like Neo4j store data as nodes and relationships.",
  "JWTs should never store sensitive information like passwords.",
  "Lighthouse audits website performance, accessibility, and SEO.",
  "React.memo prevents re-rendering unless props change.",
  "The call stack in JavaScript stores function execution contexts.",
  "SSH uses public-key cryptography to secure remote logins.",
  "SQL UNION combines results from two queries with the same structure.",
  "The viewport is the visible portion of a web page in the browser.",
  "Preloading resources helps browsers prioritize important assets.",
  "The browser cache stores files locally to speed up subsequent visits.",
  "XSS attacks happen when untrusted input is rendered as executable code.",
  "A singleton pattern restricts a class to one instance only.",
  "Load balancers distribute traffic across multiple servers to prevent overload.",
  "The async attribute on a script tag loads the file without blocking HTML parsing.",
  "The defer attribute loads the script in parallel but executes after parsing.",
  "A database schema defines the structure of tables, fields, and relations.",
  "Hydration in React attaches event listeners to server-rendered HTML.",
  "Compression like Gzip reduces file size during HTTP transfer.",
  "Binary search runs in O(log n) time, making it very efficient.",
  "Environment variables store configuration securely outside the codebase.",
  "A 302 redirect temporarily sends the browser to a different URL.",
  "Middleware can modify requests, responses, or stop the pipeline entirely.",
  "A favicon is the small icon displayed in browser tabs and bookmarks.",
  "WebAssembly allows near-native performance inside the browser.",
  "Rate limiting and API keys are essential for public API protection.",
  "SQL indexes must be updated when data changes, creating overhead.",
  "Serverless functions scale automatically based on demand."
]